In [1]:
import pandas as pd

In [4]:
var = pd.DataFrame(
    {
        "Name" : ['a','b','c','d','a','b','a','b','a','c','c','d'],
        "s1" : [12,13,14,12,13,14,15,23,25,16,10,34],
        "s2" : [23,24,25,26,27,28,29,30,25,34,25,56],
        
    }
)
var

   Name  s1  s2
0     a  12  23
1     b  13  24
2     c  14  25
3     d  12  26
4     a  13  27
5     b  14  28
6     a  15  29
7     b  23  30
8     a  25  25
9     c  16  34
10    c  10  25
11    d  34  56

In [6]:
varNew = var.groupby("Name")
varNew

In [9]:
for x,y in varNew :
    print(x)
    print(y,"\n")

a
  Name  s1  s2
0    a  12  23
4    a  13  27
6    a  15  29
8    a  25  25

b
  Name  s1  s2
1    b  13  24
5    b  14  28
7    b  23  30

c
   Name  s1  s2
2     c  14  25
9     c  16  34
10    c  10  25

d
   Name  s1  s2
3     d  12  26
11    d  34  56

In [11]:
varNew.get_group('a')

  Name  s1  s2
0    a  12  23
4    a  13  27
6    a  15  29
8    a  25  25

In [12]:
varNew.min()

      s1  s2
Name
a     12  23
b     13  24
c     10  25
d     12  26

In [14]:
varNew.max()

      s1  s2
Name
a     25  29
b     23  30
c     16  34
d     34  56

In [15]:
varNew.mean()

             s1         s2
Name
a     16.250000  26.000000
b     16.666667  27.333333
c     13.333333  28.000000
d     23.000000  41.000000

In [16]:
varNew.std()

             s1         s2
Name
a      5.965177   2.581989
b      5.507571   3.055050
c      3.055050   5.196152
d     15.556349  21.213203

In [18]:
li = list(varNew)
li

[('a',
    Name  s1  s2
  0    a  12  23
  4    a  13  27
  6    a  15  29
  8    a  25  25),
 ('b',
    Name  s1  s2
  1    b  13  24
  5    b  14  28
  7    b  23  30),
 ('c',
     Name  s1  s2
  2     c  14  25
  9     c  16  34
  10    c  10  25),
 ('d',
     Name  s1  s2
  3     d  12  26
  11    d  34  56)]